Tekla.Structures.DrawingInternal.dotGrLevelMark_t
.Net counter struct for core level mark data

Tekla.Structures.DrawingInternal.dotGrLevelMark_t.DrawingObject
The drawing object

Tekla.Structures.DrawingInternal.dotGrLevelMark_t.SubType
The sub type

Tekla.Structures.DrawingInternal.dotGrLevelMark_t.ModelObjectId
The model object identifier

Tekla.Structures.DrawingInternal.dotGrLevelMark_t.InsertionPoint
The insertion point

Tekla.Structures.DrawingInternal.dotGrLevelMark_t.BasePoint
The base point

Tekla.Structures.DrawingInternal.dotGrLevelMark_t.Placing
The placing

Tekla.Structures.DrawingInternal.dotGrLevelMark_t.Hideable
The hideable

Tekla.Structures.DrawingInternal.dotGrLevelMark_t.LevelMarkAttributes
The level mark attributes

Tekla.Structures.DrawingInternal.dotGrLevelMark_t.ToStruct(Tekla.Structures.Drawing.LevelMark)
.Net data to core data.
levelmark: The level mark.

Tekla.Structures.DrawingInternal.dotGrLevelMark_t.FromStruct(Tekla.Structures.Drawing.LevelMark)
.Net data from core data.
levelmark: The level mark.